Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/blood_and_organ_donation/organ_and_body_donation.html.txt.tmx
Source language: en
Languages: ga

source: Organ and body donation
ga: Corp agus orgáin a bhronnadh

source: • Whole body donation for medical research
ga: • Orgáin a bhronnadh • Bronnadh coirp iomlán le haghaidh taighde leighis

source: Organ donation takes healthy tissues and organs from one person so that they can be transplanted into another person, replacing organs that are not healthy
ga: Tugtar idir 200 agus 250 duine slán in Éirinn gach bliain mar gheall ar bhronnadh orgáin agus trasphlandú

source: Organs which are suitable for transplant include the heart, kidneys, lungs, liver and pancreas
ga: Má bhíonn tú i do dheontóir orgáin agus/nó fíocháin, beidh deis agat thuas le cúigear a bhfuil a gcuid orgáin ag teipeadh orthu a thabhairt slán

source: Most organs are only transplanted after the death of the donor
ga: Bealaí furasta chun do mhianta a chur in iúl ná cárta deontóra orgáin a iompar nó an rogha bronnta orgáin ar chúl do cheadúnas tiomána a shíniú

source: You can become an organ donor by carrying a donor card or using the Organ Donor Ecard smartphone app, or having your wishes noted on your driving licence
ga: Is féidir leat orgáin áirithe a bhronnadh fad is atá tú beo. Is féidir le deontóirí beo duán a bhronnadh

source: You should tell your family or next-of-kin that you wish to donate your organs after your death
ga: Chun a bheith i do dheontóir beo, ní mór duit toiliú eolasach a thabhairt

source: Your family or next-of-kin can inform a doctor or another healthcare professional in a hospital if they are asked about your wishes regarding organ donation
ga: Tá orgáin eile nach féidir a bhronnadh ach amháin tar éis don duine bás a fháil (is iad sin, na duáin, an croí, na scamhóga, an paincréas, na súile, srl.)

source: Having a medical condition does not prevent you from becoming a donor (an individual decision will be made by a healthcare professional at the time of your death)
ga: Ní chuireann riocht leighis cosc ort ó bheith i do dheontóir (déanfaidh gairmí cúram sláinte cinneadh aonair nuair a fhaigheann tú bás)

source: The medical team treating you if you are ill is separate from the transplant team
ga: Tá an fhoireann leighis a chuireann cóireáil ort agus tú tinn scartha amach ón bhfoireann trasphlandaithe

source: Organs are only removed when 2 doctors, working independently, have certified that the person is dead following a series of strict tests
ga: Ní bhaintear orgáin amach ach amháin nuair atá beirt dhochtúir, ag obair go neamhspleách ar a chéile, tar éis a dhearbhú go bhfuil an duine marbh tar éis sraith tástálacha déine a bheith déanta air/uirthi

source: It is important to know that the removal of organs is carried out with the same care and respect as any other operation
ga: Tá sé tábhachtach fios a bheith agat go léirítear an cúram agus an meas céanna nuair a bhíonn orgáin á mbaint agus a bhíonn in aon obráid eile

source: Organ donation does not disfigure the body or change the way it looks nor does it cause any delay to funeral arrangements
ga: Ní chuireann bronnadh orgáin an corp ó dhealramh ná ní athraíonn sé an chaoi a mbreathnaíonn an corp ná ní chuireann sé aon mhoill ar shocruithe sochraide

source: Organ donors and consent
ga: Deontóirí orgáin agus toiliú

source: You can indicate your wishes by carrying an organ donor card or signing the organ donation option on the back of your driving licence
ga: Is féidir leat do mhianta a chur in iúl trí chárta deontóra orgáin a iompar nó tríd an rogha deonaithe orgáin ar chúl do cheadúnas tiomána a shíniú

source: Organ donor cards are available from the Irish Donor Network (see below), through the Irish Kidney Association, and in doctors' surgeries and pharmacies
ga: Tá cártaí deontóra orgáin ar fáil ó Líonra Deontóirí na hÉireann (Irish Donor Network) (féach thíos), trí Chumann Duán na hÉireann, agus i lialanna agus i gcógaslanna

source: Signing an organ donor card or a driving licence donation option indicates your willingness to have your organs used for transplant
ga: Léiríonn síniú cárta deontóra orgáin nó rogha deontóra ar cheadúnas tiomána go bhfuil tú sásta go n-úsáidfí d’orgáin i gcomhair trasphlandaithe

source: It does not necessarily mean that they will be used
ga: Ní chiallaíonn sé go mbainfear úsáid astu

source: There are various medical criteria and other conditions that must be met
ga: Tá critéir mhíochaine agus coinníollacha eile nach mór a chomhlíonadh

source: To ensure safe transplantation, the death must take place in a hospital
ga: Chun trasphlandú sábháilte a chinntiú, ní mór gur in ospidéal a bhásaigh an duine

source: Your next-of-kin should know of your wish to be an organ donor, but they are not bound to abide by your wishes and their consent is always required
ga: Ba chóir go mbeadh a fhios ag dod’ neasghaol go bhfuil fonn ort a bheith i do dheontóir orgáin, ach níl siad faoi cheangal cloí le do mhianta agus bíonn gá lena dtoiliú i gcónaí

source: In all cases, the medical team requests the next-of-kin to donate the organs of a deceased person
ga: I ngach cás, iarrann an fhoireann mhíochaine ar an neasghaol orgáin an té atá básaithe a bhronnadh

source: In practice, the consent of the next-of-kin is accepted as valid and a refusal by the next-of-kin is not contested
ga: Go praiticiúil, glactar le toiliú an neasghaoil agus ní chuirtear i gcoinne an neasghaoil má dhiúltaíonn sé/sí orgáin a bhronnadh

source: Postmortems and organ donation
ga: Scrúduithe Iarbháis agus orgáin a bhronnadh

source: In situations where a death is reported to the Coroner, permission must be obtained from the Coroner before organ donation can take place, as well as the written consent of the next-of-kin
ga: I gcásanna ina dtuairiscítear bás don Chróinéir, ní mór cead a fháil ón gCróinéir sular féidir orgáin a bhronnadh, chomh maith le cead scríofa ón neasghaol

source: Where the Coroner grants permission for organ donation, any subsequent postmortem examination will be a limited one
ga: Sa chás go dtugann an Cróinéir cead orgáin a bhronnadh, is scrúdú teoranta a bheidh in aon scrúdú iarbháis a dhéantar ina dhiaidh sin

source: Decisions about this matter are made by the Coroner in consultation with the Gardaí and medical professionals
ga: Déanann an Cróinéir cinntí faoin ábhar seo i gcomhairle leis na Gardaí agus gairmithe leighis

source: In general, Coroners do facilitate requests for organ donation
ga: Go ginearálta, éascaíonn Cróinéirí iarratais ar bhronnadh orgáin

source: Read more about the role of the Coroner and postmortems here
ga: Léigh tuilleadh anseo faoi ról an Chróinéara agus Scrúduithe iarbháis

source: Organ donation for transplantation is not a postmortem practice and it is conducted in an operating theatre
ga: Ní cleachtas iarbháis atá i mbronnadh orgáin i gcomhair trasphlandaithe, agus déantar in obrádlann é

source: Consent for the retention of organs for research is a postmortem practice conducted in a mortuary
ga: Is cleachtas iarbháis é toiliú chun orgáin a choinneáil i gcomhair taighde, agus is i marbhlann a tharlaíonn sé

source: The Irish Donor Network
ga: Líonra Deontóirí na hÉireann (Irish Donor Network)

source: The Irish Donor Network is a group of individuals and patient associations directly concerned with organ transplantation, donor families and medical co-ordinators involved in organ and tissue transplantation
ga: Is grúpa de dhaoine aonair agus cumainn othar atá bainteach go díreach le trasphlandú orgáin, teaghlaigh bhronntóirí agus comhordaitheoirí leighis a bhaineann le trasphlandú orgáin agus fíocháin atá i Líonra Deontóirí na hÉireann

source: Those involved in the Network are:
ga: Seo a leanas na daoine atá bainteach leis an líonra seo:

source: • The Irish Kidney Association
ga: • Cumann Duán na hÉireann

source: • The Irish Heart and Lung Transplant Association
ga: • Cumann na hÉireann um Thrasphlandú Croí agus Scámhóga (The Irish Heart and Lung Transplant Association)

source: • The Cystic Fibrosis Association
ga: • Cumann Fiobróise Cistí na hÉireann (The Cystic Fibrosis Association)

source: • The Irish Lung Fibrosis Association
ga: • Cumann Fiobróise Scámhóga na hÉireann (The Irish Lung Fibrosis Association)

source: • Alpha One (Anti Trypsin) Foundation
ga: • Fondúireacht Alpha One (Anti Trypsin)

source: • Liver Transplant Unit in St.Vincent's Hospital
ga: • Aonad Trasphlandaithe Ae in Ospidéal Naomh Uinseann (Liver Transplant Unit in St.Vincent's Hospital)

source: • The Eye and Bone Banks
ga: • Banc Súl na hÉireann

source: The Irish Eye Bank no longer accepts ocular donations
ga: Sa bhliain 2004, tháinig stop le deonú súl ag Clárlann Bhanc na Súl

source: (This is due to the theoretical risk that nvCJD could be transmitted in transplanted corneas.) All corneas and sclera are now imported from the United States of America
ga: (Tharla sé seo mar thoradh ar an mbaol teoiriciúil go bhféadfaí nvCJD a tharchur i gcoirní trasphlandaithe.) Ó shin i leith, is ó Stáit Aontaithe Mheiriceá a n-iomportáiltear gach coirne agus scléara go hÉirinn

source: The Irish Donor Network promotes, prints and distributes the Gift of Life Donor Card
ga: Cuireann Líonra Deontóirí na hÉireann an Cárta Deontóra Gift of Life chun cinn, priontálann siad é agus scaipeann siad é

source: By carrying the card and informing your family, you indicate your intention of donating organs and tissue for the purpose of transplantation in the event of your death
ga: Má iompraíonn tú an cárta agus má chuireann tú do theaghlach ar an eolas, cuireann tú in iúl go bhfuil sé de mhian agat orgáin agus fíocháin a bhronnadh chun cuspóirí trasphlandaithe i gcás do bháis

source: Whole body donation for medical research
ga: Bronnadh coirp iomlán le haghaidh taighde leighis

source: Medical research is a vital way in which the health profession can learn more about anatomy, research and treating illness
ga: Is bealach ríthábhachtach é taighde leighis trínar féidir leis an ngairm leighis tuilleadh a fhoghlaim faoi anatamaíocht, taighde agus cóireáil leighis

source: If you want to donate your body for medical research, you should contact one of the 5 medical research schools located in the colleges listed below
ga: Más mian leat do chorp a bhronnadh le haghaidh taighde leighis, ba chóir duit dul i dteagmháil le ceann den 5 scoil taighde leighis atá lonnaithe sna coláistí atá liostaithe thíos

source: Each medical school has its own procedures for entering into an agreement with you
ga: Tá a nósanna imeachta féin ag gach scoil leighis chun comhaontú a dhéanamh leat

source: • The Royal College of Surgeons in Ireland
ga: • Coláiste Ríoga na Máinlia i mBaile Átha Cliath

source: • National University of Ireland, Galway
ga: • Ollscoil na hÉireann, Gaillimh

source: You should also make sure that your next-of-kin are aware of your wishes
ga: Ba chóir duit a bheith cinnte freisin go bhfuil do neasghaol ar an eolas faoi do mhianta

source: You can do this by telling them and/or stating that you wish to donate your body for medical research in your will
ga: Is féidir leat é seo a dhéanamh trí insint dóibh agus/nó a chur in iúl gur mian leat do chorp a bhronnadh i gcomhair taighde leighis i d’uacht

source: The law is unclear on this but it would seem that your next-of-kin, or whoever is responsible for the cremation or interment of your body, are not necessarily obliged to go along with your wishes
ga: Níl an dlí soiléir ina leith seo, ach is cosúil nach gá dod’ neasghaol, nó cibé atá freagrach as créamadh nó cur do choirp, cloí le do mhianta

source: You can contact any member of the Irish Donor Network for further information or for organ donor cards. You can apply for an Organ Donor Card online or download the smartphone app for the Organ Donor Ecard
ga: Is féidir leat dul i dteagmháil le ball ar bith de Líonra Deontóirí na hÉireann chun tuilleadh eolais a fháil nó chun cárta deontóra orgáin a fháil

source: Free text the word 'Donor' to 50050 or Lo-call 1890 543 639
ga: Seol ríomhphost chuig donor@ika.ie, seol téacstheachtaireacht in aisce leis an bhfocal ‘Donor’ chuig 50050 nó cuir glaoch Íosghlao ar Donor House ag 1890 543 639
